app/views/employees/show.html.erb

SELECT "employees".* FROM "employees" WHERE "employees"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT "timers".* FROM "timers" WHERE "timers"."employee_id" = ? ORDER BY "timers"."id" DESC LIMIT ?  [["employee_id", 2], ["LIMIT", 1]]
SELECT "timers".* FROM "timers" ORDER BY "timers"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
      <div>
        <% if current_user.employee.timers.blank? %>
          <%= link_to 'Clock In', timers_clockin_path, class:'btn btn-success' %>
        <% elsif current_user.employee.timers.last.time_in.blank? or current_user.employee.timers.last.time_in.present? and current_user.employee.timers.last.time_out.present? %>

SELECT "timers".* FROM "timers" WHERE "timers"."employee_id" = ? ORDER BY "timers"."id" DESC LIMIT ?  [["employee_id", 2], ["LIMIT", 1]]
---
      <br>
      <% if current_user.employee.timers.last.blank? %>

SELECT "timers".* FROM "timers" WHERE "timers"."employee_id" = ? ORDER BY "timers"."id" DESC LIMIT ?  [["employee_id", 2], ["LIMIT", 1]]
---
      <p class="text-left">
        Welcome to work! Your last reporting time was on <b><%= current_user.employee.timers.last.time_in.strftime("%d, %b %Y,") %></b> at <b><%= current_user.employee.timers.last.time_in.strftime("%I:%M %p") %></b>

SELECT "timers".* FROM "timers" WHERE "timers"."employee_id" = ? ORDER BY "timers"."id" DESC LIMIT ?  [["employee_id", 1], ["LIMIT", 1]]
---
      <p class="text-left">
        Your last clockout time was on <b><%= current_user.employee.timers.last.time_out.strftime("%d, %b %Y,") if current_user.employee.timers.last.time_out %></b> at <b><%= current_user.employee.timers.last.time_out.strftime("%I:%M %p") if current_user.employee.timers.last.time_out %></b>