app/controllers/employees_controller.rb

  def show
    if current_user.employee.blank?
      redirect_to new_employee_path
    end
    @clock_type = current_user.employee.timers.last.blank? or current_user.employee.timers.last.time_in.blank? or current_user.employee.timers.last.time_in.present? and current_user.employee.timers.last.time_out.present?
---
SELECT "employees".* FROM "employees" WHERE "employees"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT "timers".* FROM "timers" WHERE "timers"."employee_id" = ? ORDER BY "timers"."id" DESC LIMIT ?  [["employee_id", 2], ["LIMIT", 1]]

  def create
    @employee = Employee.new(employee_params)

    respond_to do |format|
      if @employee.save
---
INSERT INTO "employees" ("first_name", "last_name", "ssn", "address", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @employee.update(employee_params)
---
UPDATE "employees" SET "updated_at" = ? WHERE "employees"."id" = ?  [["updated_at", "2020-11-11 00:00:04.542117"], ["id", 1]]