app/controllers/timers_controller.rb

  def index
    @timers = current_user.employee.timers.order(id: :desc)
---
SELECT "timers".* FROM "timers" WHERE "timers"."employee_id" = ? ORDER BY "timers"."id" DESC  [["employee_id", 3]]
SELECT "employees".* FROM "employees" WHERE "employees"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]

  def clockin
    Timer.create(time_in:Time.now, employee_id:current_user.employee.id)
---
INSERT INTO "timers" ("employee_id", "time_in", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["employee_id", 3], ["time_in", "2020-11-18 21:52:12.997545"], ["created_at", "2020-11-18 21:52:13.009107"], ["updated_at", "2020-11-18 21:52:13.009107"]]

  def clockout
    timer = Timer.last
    timer.time_out = Time.now
    timer.save
---
SELECT "timers".* FROM "timers" ORDER BY "timers"."id" DESC LIMIT ?  [["LIMIT", 1]]
UPDATE "timers" SET "time_out" = ?, "updated_at" = ? WHERE "timers"."id" = ?  [["time_out", "2020-11-18 18:11:44.314354"], ["updated_at", "2020-11-18 18:11:44.323132"], ["id", 4]]

    def set_timer
      @timer = Timer.find(params[:id])
---
SELECT "timers".* FROM "timers" WHERE "timers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]